src/СРМ/src/Documents/Задача/Задача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Задача</name>
  <basedOn>Document.Задача</basedOn>
  <registerRecords>AccumulationRegister.Трудозатраты</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРаботПоЗадаче</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактОбращения</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаТрудозатрат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаТрудозатратИсполнителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Редактор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскаяЗадача</name>
    <type>
      <types>DocumentRef.Задача</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Спринт</name>
    <type>
      <types>DocumentRef.Спринт</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполненияАвто</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Срочность</name>
    <type>
      <types>CatalogRef.СрочностиЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>CatalogRef.ВидыОплатыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеФормат</name>
    <type>
      <types>EnumRef.ФорматыТекстаКомментариев</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияЗакрытия</name>
    <type>
      <types>CatalogRef.КатегорииЗакрытияЗадач</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолучателиКопий</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОтправки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/СРМ/src/AccumulationRegisters/Трудозатраты/Трудозатраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Трудозатраты</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Факт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>План</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Предмет</name>
    <type>
      <types>DefinedType.ПредметУчетаТрудозатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/СРМ/src/Enums/ВидыСтатусовЗадач/ВидыСтатусовЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСтатусовЗадач</name>
  <enumValues>
    <name>Новая</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
</mdclass:Enum>

src/СРМ/src/Catalogs/СпискиСтатусовЗадач/СпискиСтатусовЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СпискиСтатусовЗадач</name>
  <predefined>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>Выполненные</name>
      <description>Выполненные</description>
    </items>
    <items>
      <name>Закрытые</name>
      <description>Закрытые</description>
    </items>
    <items>
      <name>КВыполнению</name>
      <description>К выполнению</description>
    </items>
    <items>
      <name>НеВыполненные</name>
      <description>Не выполненные</description>
    </items>
    <items>
      <name>Новые</name>
      <description>Новые</description>
    </items>
    <items>
      <name>Отклоненные</name>
      <description>Отклоненные</description>
    </items>
    <items>
      <name>Открытые</name>
      <description>Открытые</description>
    </items>
  </predefined>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокСтатусов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Статусы</name>
    <attributes>
      <name>Статус</name>
      <type>
        <types>CatalogRef.СтатусыЗадач</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/СРМ/src/Documents/Задача/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	РеквизитыДоИзменения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, 
		"Статус,ДатаВыполнения,ДатаЗакрытия,ДатаНачалаРаботПоЗадаче");
	
	СтатусНовый = УправлениеЗадачамиПовтИсп.СтатусЗадачиНовый();
	СтатусВРаботе = УправлениеЗадачамиПовтИсп.СтатусЗадачиВРаботе();
	СтатусыНеВыполненных = УправлениеЗадачамиПовтИсп.СтатусыНеВыполненныхЗадач();
	СтатусыВыполненных = УправлениеЗадачамиПовтИсп.СтатусыСписка(Справочники.СпискиСтатусовЗадач.Выполненные);
	СтатусыЗакрытых = УправлениеЗадачамиПовтИсп.СтатусыСписка(Справочники.СпискиСтатусовЗадач.Закрытые);
	
	// ДатаВыполнения
	Если СтатусыНеВыполненных.НайтиПоЗначению(РеквизитыДоИзменения.Статус) <> Неопределено 
		И СтатусыНеВыполненных.НайтиПоЗначению(Статус) = Неопределено Тогда
		
		ДатаВыполнения = ТекущаяДатаСеанса();
	ИначеЕсли СтатусыНеВыполненных.НайтиПоЗначению(Статус) <> Неопределено Тогда
		ДатаВыполнения = '00010101000000';
	КонецЕсли;
	
	// ДатаЗакрытия
	Если СтатусыЗакрытых.НайтиПоЗначению(РеквизитыДоИзменения.Статус) = Неопределено 
		И СтатусыЗакрытых.НайтиПоЗначению(Статус) <> Неопределено Тогда
		
		ДатаЗакрытия = ТекущаяДатаСеанса();
	ИначеЕсли СтатусыЗакрытых.НайтиПоЗначению(Статус) = Неопределено Тогда
		ДатаЗакрытия = '00010101000000';
	КонецЕсли;
	
	// ДатаНачалаРаботПоЗадаче
	Если (Не ЗначениеЗаполнено(РеквизитыДоИзменения.Статус) ИЛИ РеквизитыДоИзменения.Статус = СтатусНовый) 
		И Статус <> СтатусНовый Тогда
		
		ДатаНачалаРаботПоЗадаче = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// Установка срока исполнения авто, если срок задан вручную
	Если ЗначениеЗаполнено(СрокИсполнения) Тогда
		СрокИсполненияАвто = СрокИсполнения;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("Изменения", УправлениеЗадачами.ИзмененияОбъектаПередЗаписью(ЭтотОбъект, Ложь));
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ТрудозатратыПоЗадачам 
	Движения.Трудозатраты.Записывать = Истина;
	Движение = Движения.Трудозатраты.Добавить();
	Движение.Период = Дата;
	Движение.Предмет = Ссылка;
	Движение.Автор = Исполнитель;
	Движение.План = ОценкаТрудозатратИсполнителя;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Статус = УправлениеЗадачамиПовтИсп.СтатусЗадачиНовый();
	СодержаниеФормат=УправлениеЗадачамиПовтИсп.ФорматТекстаКомментарияПоУмолчанию();
		
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Задача") Тогда
		
		РодительскаяЗадача = ДанныеЗаполнения;
		
		РеквизитыРодительскойЗадачи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			РодительскаяЗадача,
			"КонтактОбращения,Проект,Спринт,СрокИсполнения,Срочность");
			
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыРодительскойЗадачи);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Статус = УправлениеЗадачамиПовтИсп.СтатусЗадачиНовый();
	
	ДатаСоздания = '00010101000000';
	ДатаИзменения = '00010101000000';
	ДатаЗакрытия = '00010101000000';
	ДатаВыполнения = '00010101000000';
	ДатаНачалаРаботПоЗадаче = '00010101000000';
	СрокИсполненияАвто = '00010101000000';
	
	Если ТипЗнч(Основание) = Тип("СправочникСсылка.Уроки") Тогда
		Основание = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	УправлениеЗадачами.ЗаписатьИзмененияКлючевыхРеквизитовЗадачиПриЗаписи(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Статус.Вид=Перечисления.ВидыСтатусовЗадач.Отклонена
		Или Статус.Вид=Перечисления.ВидыСтатусовЗадач.Закрыта Тогда
			
		ПроверяемыеРеквизиты.Добавить("КатегорияЗакрытия");
	КонецЕсли;
	
	Если Статус.Вид = Перечисления.ВидыСтатусовЗадач.Закрыта Тогда
		ПроверяемыеРеквизиты.Добавить("ВидОплаты");
		
		Если ВидОплаты = Справочники.ВидыОплатыЗадач.Платная Тогда
			ПроверяемыеРеквизиты.Добавить("ОценкаТрудозатрат");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
